```sql
--Table Script:

create table dept (
    dept_id int,
    deptname varchar(10),
    empname varchar(10),
    salary int
    );

insert into dept values(1,'HR','A',100);
insert into dept values(1,'HR','B',200);
insert into dept values(1,'HR','C',300);

insert into dept values(2,'SALES','D',400);
insert into dept values(2,'SALES','E',500);
insert into dept values(2,'SALES','F',600);

insert into dept values(3,'TECH','G',700);
insert into dept values(3,'TECH','H',800);
insert into dept values(3,'TECH','I',900);

``` sql
select * from dept;

+---------+----------+---------+--------+
| dept_id | deptname | empname | salary |
+---------+----------+---------+--------+
|       1 | HR       | A       |    100 |
|       1 | HR       | B       |    200 |
|       1 | HR       | C       |    300 |
|       2 | SALES    | D       |    400 |
|       2 | SALES    | E       |    500 |
|       2 | SALES    | F       |    600 |
|       3 | TECH     | G       |    700 |
|       3 | TECH     | H       |    800 |
|       3 | TECH     | I       |    900 |
+---------+----------+---------+--------+

Q. Write an SQL query to display the second highest salary deptwise using correlated query.

Expected Output:
+----------+---------+--------+
| deptname | empname | salary |
+----------+---------+--------+
| HR       | C       |    300 |
| SALES    | E       |    500 |
| TECH     | G       |    700 |
+----------+---------+--------+

**Solution:**
``` sql
select * from dept as d1
where 1 = (select count(*) from dept as d2 
where d2.salary > d1.salary and d2.deptname = d1.deptname)

**Question-2:**
``` sql

+---------+----------+---------+--------+
| dept_id | deptname | empname | salary |
+---------+----------+---------+--------+
|       1 | HR       | A       |    100 |
|       1 | HR       | B       |    200 |
|       1 | HR       | C       |    300 |
|       2 | SALES    | D       |    400 |
|       2 | SALES    | E       |    500 |
|       2 | SALES    | F       |    600 |
|       3 | TECH     | G       |    700 |
|       3 | TECH     | H       |    800 |
|       3 | TECH     | I       |    900 |
+---------+----------+---------+--------+

Q.Write an SQL query to find the employee earning highest salary in HR dept,second highest salary in Sales dept and third highest salary in Tech dept.

+----------+---------+--------+
| deptname | empname | salary |
+----------+---------+--------+
| HR       | C       |    300 |
| SALES    | E       |    500 |
| TECH     | G       |    700 |
+----------+---------+--------+

**Solution:**
``` sql

select deptname, empname, salary 
from(
select *, rank() over(partition by deptname order by salary desc) as rn from dept
) a
where dept_id = rn

=======================================================================

with cte as(
select Deptname,empname,salary, 
dense_rank() over (partition by deptname order by salary desc ) as rnk from dept)

select Deptname,empname,salary from cte 
where (rnk = 1 and Deptname = 'HR') or (rnk =2 and Deptname = 'SALES') or (rnk =3 and Deptname = 'TECH');